CreeMark/STM32_SmartCharge_HAL/Bsp/UART/bsp_UART.c
/***********************************************************************************************************************************
 ** 【代码编写】  魔女开发板团队
 ** 【代码更新】
 ** 【淘    宝】  魔女开发板      https://demoboard.taobao.com
 ***********************************************************************************************************************************
 **【文件名称】  bsp_UART.c
 **
 **【文件功能】  各USART的GPIO配置、通信协议配置、中断配置，及功能函数实现
 **
 **【适用平台】  STM32F103 + HAL库 + keil5
 **
************************************************************************************************************************************/
#include "bsp_UART.h"     // 头文件
#include <stdarg.h>       // 用于支持不定长参数






/*****************************************************************************
 ** 声明本地变量
****************************************************************************/
typedef struct
{
    uint16_t  usRxNum;            // 新一帧数据，接收到多少个字节数据
    uint8_t  *puRxData;           // 新一帧数据，数据缓存; 存放的是空闲中断后，从临时接收缓存复制过来的完整数据，并非接收过程中的不完整数据;

    uint8_t  *puTxFiFoData;       // 发送缓冲区，环形队列; 为了方便理解阅读，没有封装成队列函数
    uint16_t  usTxFiFoData ;      // 环形缓冲区的队头
    uint16_t  usTxFiFoTail ;      // 环形缓冲区的队尾
} xUSATR_TypeDef;



#if 0
/******************************************************************************
 * 函  数： delay_us
 * 功  能： ms 延时函数
 * 备  注： 1、系统时钟72MHz
 *          2、打勾：Options/ c++ / One ELF Section per Function
            3、编译优化级别：Level 3(-O3)
 * 参  数： uint32_t  us  微秒值
 * 返回值： 无
 ******************************************************************************/
static volatile uint32_t ulTimesUS;    // 使用volatile声明，防止变量被编译器优化
static void delay_us(uint16_t us)
{
    ulTimesUS = us ;
    while (ulTimesUS)
        ulTimesUS--;                   // 操作外部变量，防止空循环被编译器优化掉
}
#endif



/******************************************************************************
 * 函  数： delay_ms
 * 功  能： ms 延时函数
 * 备  注： 1、系统时钟72MHz
 *          2、打勾：Options/ c++ / One ELF Section per Function
            3、编译优化级别：Level 3(-O3)
 * 参  数： uint32_t  ms  毫秒值
 * 返回值： 无
 ******************************************************************************/
static volatile uint32_t ulTimesMS;    // 使用volatile声明，防止变量被编译器优化
static void delay_ms(uint16_t ms)
{
    ulTimesMS = ms * 650;              
    while (ulTimesMS)
        ulTimesMS--;                   // 操作外部变量，防止空循环被编译器优化掉
}



//////////////////////////////////////////////////////////////   USART-1   //////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#if UART1_EN

static xUSATR_TypeDef  xUART1 = { 0 };                      // 定义 UART1 的收发结构体
static uint8_t uaUART1RxData[UART1_RX_BUF_SIZE];            // 定义 UART1 的接收缓存
static uint8_t uaUART1TxFiFoData[UART1_TX_BUF_SIZE];        // 定义 UART1 的发送缓存

/******************************************************************************
 * 函  数： UART1_Init
 * 功  能： 初始化USART1的通信引脚、协议参数、中断优先级
 *          引脚：TX-PA10、RX-PA11
 *          协议：波特率-None-8-1
 *          发送：发送中断
 *          接收：接收+空闲中断
 *
 * 参  数： uint32_t  ulBaudrate  通信波特率
 * 返回值： 无
 ******************************************************************************/
void UART1_Init(uint32_t ulBaudrate)
{
    // 使能相关时钟
    RCC->APB2ENR |= RCC_APB2ENR_USART1EN;                       // 使能外设：USART1
    RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;                         // 使能GPIO：GPIOA                                                         
    
    #ifdef USE_STDPERIPH_DRIVER  
    // TX引脚 配置                                                                   
    GPIO_InitTypeDef  GPIO_InitStructure = {0};                                      // GPIO 初始化结构体
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_9;                                      // TX 引脚
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;                                 // 引脚功能
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;                                // 输出速度
    GPIO_Init(GPIOA, &GPIO_InitStructure);                                           // 初始化引脚
    // RX引脚 配置                                                                   
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_10;                                     // RX 引脚
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;                                   // RX引脚工作模式：上拉输入; 如果使用浮空输入，引脚空置时可能产生误输入; 当电路上为一主多从电路时，可以使用复用开漏模式
    GPIO_Init(GPIOA, &GPIO_InitStructure);                                           // 初始化引脚
    // 中断 配置                                                                     
    NVIC_InitTypeDef  NVIC_InitStructure = {0};                                      // 优先级配置结构体
    NVIC_InitStructure .NVIC_IRQChannel = USART1_IRQn;                               // 中断编号
    NVIC_InitStructure .NVIC_IRQChannelPreemptionPriority = 2 ;                      // 抢占优先级
    NVIC_InitStructure .NVIC_IRQChannelSubPriority = 2;                              // 子优先级
    NVIC_InitStructure .NVIC_IRQChannelCmd = ENABLE;                                 // IRQ通道使能
    NVIC_Init(&NVIC_InitStructure);                                                  // 初始化中断优先级
    //USART 设置                                                                     
    USART_DeInit(USART1);                                                            // 复位串口
    USART_InitTypeDef USART_InitStructure = {0};                                     // UART配置结构体 
    USART_InitStructure.USART_BaudRate   = ulBaudrate;                               // 波特率
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;                      // 位长
    USART_InitStructure.USART_StopBits   = USART_StopBits_1;                         // 停止位
    USART_InitStructure.USART_Parity     = USART_Parity_No;                          // 奇偶校验
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;  // 硬件流控制
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;                  // 使能工作模式
    USART_Init(USART1, &USART_InitStructure);                                        // 初始化串口
    // 打开中断
    USART_ITConfig(USART1, USART_IT_TXE, DISABLE);                                   // 发送中断 使能
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);                                   // 接收中断 使能
    USART_ITConfig(USART1, USART_IT_IDLE, ENABLE);                                   // 空闲中断 使能
    // 使能串口
    USART_Cmd(USART1, ENABLE);                                                       // 使能串口, 开始工作
#endif  
    
#ifdef USE_HAL_DRIVER  
    // 关闭串口                                                 
    USART1 -> CR1  =   0;                                       // 关闭串口，配置清零
    // 配置TX引脚
    GPIO_InitTypeDef    GPIO_InitStruct = {0};                  // 声明初始化要用到的结构体
    GPIO_InitStruct.Pin   = GPIO_PIN_9 ;                        // 引脚 TX-PA9
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;                    // 工作模式
    GPIO_InitStruct.Pull  = GPIO_NOPULL;                        // 上下拉
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;               // 引脚速率
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);                     // 初始化引脚工作模式
    // 配置RX引脚                                               
    GPIO_InitStruct.Pin   =  GPIO_PIN_10;                       // 引脚 RX-PA10
    GPIO_InitStruct.Mode  = GPIO_MODE_INPUT;                    // 工作模式
    GPIO_InitStruct.Pull  = GPIO_PULLUP;                        // 上下拉
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;               // 引脚速率
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);                     // 初始化引脚工作模式                                                                
    // 中断优选级配置                                           
    HAL_NVIC_SetPriority(USART1_IRQn, 0, 0);                    // 配置中断线的优先级
    HAL_NVIC_EnableIRQ(USART1_IRQn);                            // 使能中断线
    // 计算波特率参数
    float    temp;
    uint16_t mantissa, fraction;
    SystemCoreClockUpdate();                                    // 更新系统运行频率全局值; 函数SystemCoreClock( )，在标准库、HAL库通用
    temp = (float)SystemCoreClock  / (ulBaudrate * 16);         // 波特率公式计算; USART1挂载在APB2, 时钟为系统时钟的1分频; 全局变量SystemCoreClock，在标准库、HAL库通用;
    mantissa = temp;				                            // 整数部分
    fraction = (temp - mantissa) * 16;                          // 小数部分
    USART1 -> BRR  = mantissa << 4 | fraction;                  // 设置波特率
    // 串口通信参数配置
    USART1 -> CR1  =   0;                                       // 清0
    USART1 -> CR1 |=   0x01 << 2;                               // 接收使能[02]: 0=失能、1=使能
    USART1 -> CR1 |=   0x01 << 3;                               // 发送使能[03]：0=失能、1=使能
    USART1 -> CR1 |=   0x00 << 9;                               // 奇偶校验[09]：0=偶Even、1=奇Odd;  注意：使用奇偶校验，下面两项要置1
    USART1 -> CR1 |=   0x00 << 10;                              // 校验位  [10]：0=禁用、1=使能;     注意，使用奇偶校验，此位要置1 (否则无效、数据错乱)
    USART1 -> CR1 |=   0x00 << 12;                              // 数据位  [12]：0=8位、 1=9位;      注意：使用奇偶校验，此位要置1 (否则数据会发生错乱)
    USART1 -> CR2  =   0;                                       // 数据清0
    USART1 -> CR2 &= ~(0x03 << 12);                             // 停止位[13:12]：00b=1个停止位、01b=0.5个停止位、10b=2个停止位、11b=1.5个停止位
    USART1 -> CR3  =   0;                                       // 数据清0
    USART1 -> CR3 &= ~(0x01 << 6);                              // DMA接收[6]: 0=禁止、1=使能
    USART1 -> CR3 &= ~(0x01 << 7);                              // DMA发送[7]: 0=禁止、1=使能
    // 串口中断设置
    USART1 -> CR1 &= ~(0x01 << 7);                              // 关闭发送中断
    USART1 -> CR1 |=   0x01 << 5;                               // 使能接收中断: 接收缓冲区非空
    USART1 -> CR1 |=   0x01 << 4;                               // 使能空闲中断：超过1字节时间没收到新数据
    USART1 -> SR   = ~(0x00F0);                                 // 清理中断
    // 打开串口
    USART1 -> CR1 |=   0x01 << 13;                              // 使能UART开始工作
#endif

    // 清理中断
    USART1->SR = ~(0x00F0);                                     // 清理中断
    // 关联缓冲区
    xUART1.puRxData = uaUART1RxData;                            // 关联接收缓冲区的地址
    xUART1.puTxFiFoData = uaUART1TxFiFoData;                    // 关联发送缓冲区的地址
    // 输出提示
    printf("\r\r\r===========  STM32F103 Peripheral Init Report ===========\r");              // 输出到串口助手
    SystemCoreClockUpdate();                                                                  // 更新一下系统运行频率变量
    printf("System Clock Freq      %d MHz\r", SystemCoreClock / 1000000);                   // 输出到串口助手
    printf("UART1 Config           %d-None-8-1; Init & TX/RX Ready\r", ulBaudrate);         // 输出到串口助手
}

