CreeMark/STM32_SmartCharge_HAL/Bsp/UART/bsp_UART.c
/******************************************************************************
 * 函  数： UART3_GetRxData
 * 功  能： 获取最新一帧数据 (数据的地址）
 * 参  数： 无
 * 返回值： 数据的地址(uint8_t*)
 ******************************************************************************/
uint8_t *UART3_GetRxData(void)
{
    return xUART3.puRxData ;
}

/******************************************************************************
 * 函  数： UART3_ClearRx
 * 功  能： 清理最后一帧数据的缓存
 *          主要是清0字节数，因为它是用来判断接收的标准
 * 参  数： 无
 * 返回值： 无
 ******************************************************************************/
void UART3_ClearRx(void)
{
    xUART3.usRxNum = 0 ;
}
#endif  // endif UART3_EN





//////////////////////////////////////////////////////////////   UART-4   //////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#if UART4_EN

static xUSATR_TypeDef  xUART4 = { 0 };                      // 定义 UART4 的收发结构体
static uint8_t uaUart4RxData[UART4_RX_BUF_SIZE];            // 定义 UART4 的接收缓存
static uint8_t uaUart4TxFiFoData[UART4_TX_BUF_SIZE];        // 定义 UART4 的发送缓存

/******************************************************************************
 * 函  数： UART4_Init
 * 功  能： 初始化UART4的通信引脚、协议参数、中断优先级
 *          引脚：TX-PC10、RX-PC11
 *          协议：波特率-None-8-1
 *          发送：发送中断
 *          接收：接收+空闲中断
 *
 * 参  数： uint32_t ulBaudrate  通信波特率
 * 返回值： 无
 ******************************************************************************/
void UART4_Init(uint32_t ulBaudrate)
{
    // 使能相关时钟
    RCC->APB1ENR |= RCC_APB1ENR_UART4EN;                        // 使能外设：UART4
    RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;                         // 使能GPIO：GPIOC
              
#ifdef USE_STDPERIPH_DRIVER                                                          // 标准库 配置
    // TX引脚 配置                                                                   
    GPIO_InitTypeDef  GPIO_InitStructure = {0};                                      // GPIO 初始化结构体
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_10;                                     // TX 引脚
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;                                 // 引脚功能
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;                                // 输出速度
    GPIO_Init(GPIOC, &GPIO_InitStructure);                                           // 初始化引脚
    // RX引脚 配置                                                                   
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_11;                                     // RX 引脚
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;                                   // RX引脚工作模式：上拉输入; 如果使用浮空输入，引脚空置时可能产生误输入; 当电路上为一主多从电路时，可以使用复用开漏模式
    GPIO_Init(GPIOC, &GPIO_InitStructure);                                           // 初始化引脚
    // 中断 配置                                                                     
    NVIC_InitTypeDef  NVIC_InitStructure = {0};                                      // 优先级配置结构体
    NVIC_InitStructure .NVIC_IRQChannel = UART4_IRQn;                                // 中断编号
    NVIC_InitStructure .NVIC_IRQChannelPreemptionPriority = 2 ;                      // 抢占优先级
    NVIC_InitStructure .NVIC_IRQChannelSubPriority = 2;                              // 子优先级
    NVIC_InitStructure .NVIC_IRQChannelCmd = ENABLE;                                 // IRQ通道使能
    NVIC_Init(&NVIC_InitStructure);                                                  // 初始化中断优先级
    //USART 设置                                                                     
    USART_DeInit(UART4);                                                             // 复位串口
    USART_InitTypeDef USART_InitStructure = {0};                                     // UART配置结构体 
    USART_InitStructure.USART_BaudRate   = ulBaudrate;                               // 波特率
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;                      // 位长
    USART_InitStructure.USART_StopBits   = USART_StopBits_1;                         // 停止位
    USART_InitStructure.USART_Parity     = USART_Parity_No;                          // 奇偶校验
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;  // 硬件流控制
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;                  // 使能工作模式
    USART_Init(UART4, &USART_InitStructure);                                         // 初始化串口
    // 打开中断
    USART_ITConfig(UART4, USART_IT_TXE, DISABLE);                                    // 发送中断 使能
    USART_ITConfig(UART4, USART_IT_RXNE, ENABLE);                                    // 接收中断 使能
    USART_ITConfig(UART4, USART_IT_IDLE, ENABLE);                                    // 空闲中断 使能
    // 使能串口
    USART_Cmd(UART4, ENABLE);                                                        // 使能串口, 开始工作
#endif   
    
#ifdef USE_HAL_DRIVER       
    // 关闭串口                                                 
    UART4 -> CR1  =   0;                                        // 关闭串口，配置清零                                                                
    // 配置TX引脚                                               
    GPIO_InitTypeDef    GPIO_InitStruct = {0};                  // 声明初始化要用到的结构体
    GPIO_InitStruct.Pin   = GPIO_PIN_10 ;                       // 引脚 TX-PC10
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;                    // 工作模式
    GPIO_InitStruct.Pull  = GPIO_NOPULL;                        // 上下拉
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;               // 引脚速率
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);                     // 初始化引脚工作模式
    // 配置RX引脚                                                      
    GPIO_InitStruct.Pin   =  GPIO_PIN_11;                       // 引脚 RX-PC11
    GPIO_InitStruct.Mode  = GPIO_MODE_INPUT;                    // 工作模式
    GPIO_InitStruct.Pull  = GPIO_PULLUP;                        // 上下拉
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;               // 引脚速率
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);                     // 初始化引脚工作模式                                                                
    // 中断优选级配置                                           
    HAL_NVIC_SetPriority(UART4_IRQn, 0, 0);                     // 配置中断线的优先级
    HAL_NVIC_EnableIRQ(UART4_IRQn);                             // 使能中断线                                                                
    // 计算波特率参数                                           
    float    temp;                                              
    uint16_t mantissa, fraction;                                
    SystemCoreClockUpdate();                                    // 更新系统运行频率全局值; 函数SystemCoreClock( )，在标准库、HAL库通用
    temp = (float)(SystemCoreClock / 2) / (ulBaudrate * 16);    // 波特率公式计算; UART4挂载在APB1, 时钟为系统时钟的2分频; 全局变量SystemCoreClock，在标准库、HAL库通用;
    mantissa = temp;				                            // 整数部分
    fraction = (temp - mantissa) * 16;                          // 小数部分
    UART4 -> BRR  = mantissa << 4 | fraction;                   // 设置波特率
    // 串口通信参数配置
    UART4 -> CR1  =   0;                                        // 清0
    UART4 -> CR1 |=   0x01 << 2;                                // 接收使能[02]: 0=失能、1=使能
    UART4 -> CR1 |=   0x01 << 3;                                // 发送使能[03]：0=失能、1=使能
    UART4 -> CR1 |=   0x00 << 9;                                // 奇偶校验[09]：0=偶Even、1=奇Odd;  注意：使用奇偶校验，下面两项要置1
    UART4 -> CR1 |=   0x00 << 10;                               // 校验位  [10]：0=禁用、1=使能;     注意，使用奇偶校验，此位要置1 (否则无效、数据错乱)
    UART4 -> CR1 |=   0x00 << 12;                               // 数据位  [12]：0=8位、 1=9位;      注意：使用奇偶校验，此位要置1 (否则数据会发生错乱)
    UART4 -> CR2  =   0;                                        // 数据清0
    UART4 -> CR2 &= ~(0x03 << 12);                              // 停止位[13:12]：00b=1个停止位、01b=0.5个停止位、10b=2个停止位、11b=1.5个停止位
    UART4 -> CR3  =   0;                                        // 数据清0
    UART4 -> CR3 &= ~(0x01 << 6);                               // DMA接收[6]: 0=禁止、1=使能
    UART4 -> CR3 &= ~(0x01 << 7);                               // DMA发送[7]: 0=禁止、1=使能
    // 串口中断设置                                            
    UART4 -> CR1 &= ~(0x01 << 7);                               // 关闭发送中断
    UART4 -> CR1 |=   0x01 << 5;                                // 使能接收中断: 接收缓冲区非空
    UART4 -> CR1 |=   0x01 << 4;                                // 使能空闲中断：超过1字节时间没收到新数据
    UART4 -> SR   = ~(0x00F0);                                  // 清理中断
    // 打开串口                                                
    UART4 -> CR1 |=   0x01 << 13;                               // 使能UART开始工作
#endif

    // 清理中断
    UART4->SR = ~(0x00F0);                                      // 清理中断
    // 关联缓冲区                                              
    xUART4.puRxData = uaUart4RxData;                            // 获取接收缓冲区的地址
    xUART4.puTxFiFoData = uaUart4TxFiFoData;                    // 获取发送缓冲区的地址
    // 输出提示
    printf("UART4 初始化配置         %d-None-8-1; 已完成初始化配置、收发配置\r", ulBaudrate);
}

