CreeMark/STM32_SmartCharge_HAL/Bsp/UART/bsp_UART.c
/******************************************************************************
 * 函  数： showData
 * 功  能： 把数据，经串口1，发送到串口助手上，方便观察
 * 参  数： uint8_t  *rxData   数据地址
 *          uint16_t  rxNum    字节数
 * 返回值： 无
 ******************************************************************************/
void showData(uint8_t *rxData, uint16_t rxNum)
{
#if 0                                                          // 写法1
    printf("字节数： %d \r", rxNum);                           // 显示字节数
    printf("ASCII 显示数据: %s\r", (char *)rxData);            // 显示数据，以ASCII方式显示，即以字符串的方式显示
    printf("16进制显示数据: ");                                // 显示数据，以16进制方式，显示每一个字节的值
    while (rxNum--)                                            // 逐个字节判断，只要不为'\0', 就继续
        printf("0x%X ", *rxData++);                            // 格式化
    printf("\r\r");                                            // 显示换行
#else                                                          // 写法2
    UART1_SendString("字节数：%d \r", rxNum);                  // 显示字节数
    UART1_SendString("ASCII : %s\r", (char *)rxData);          // 显示数据，以ASCII方式显示，即以字符串的方式显示
    UART1_SendString("16进制: ");                              // 显示数据，以16进制方式，显示每一个字节的值
    while (rxNum--)                                            // 逐个字节判断，只要不为'\0', 就继续
        UART1_SendString("0x%X ", *rxData++);                  // 格式化
    UART1_SendString("\r\r");                                  // 显示换行
#endif
}





//////////////////////////////////////////////////////////////  printf   //////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************
 * 功  能： printf函数支持代码
 *         【特别注意】加入以下代码, 使用printf函数时, 不再需要选择use MicroLIB
 * 参  数：
 * 返回值：
 * 备  注： 最后修改_2020年07月15日
 ******************************************************************************/
#pragma import(__use_no_semihosting)

struct __FILE
{
    int handle;
};                                         // 标准库需要的支持函数

FILE __stdout;                             // FILE 在stdio.h文件
void _sys_exit(int x)
{
    x = x;                                 // 定义_sys_exit()以避免使用半主机模式
}

int fputc(int ch, FILE *f)                 // 重定向fputc函数，使printf的输出，由fputc输出到UART,  这里使用串口1(USART1)
{
#if 0                                      // 方式1-使用常用的方式发送数据，比较容易理解，但等待耗时大  
    while ((USART1->SR & 0X40) == 0);      // 等待上一次串口数据发送完成
    USART1->DR = (u8) ch;                  // 写DR,串口1将发送数据
#else
    UART1_SendData((uint8_t *)&ch, 1);     // 方式2-使用队列+中断方式发送数据; 无需像方式1那样等待耗时，但要借助已写好的函数、环形缓冲
#endif
    return ch;
}

// 文件结尾，需要保留至少1空行
